snlkuharlocal/src/DataProcessors/ПроведениеДокументовПути/ПроведениеДокументовПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроведениеДокументовПути</name>
  <attributes>
    <name>фПакетныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументГраницы</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индикатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГП</name>
    <attributes>
      <name>ДатаГраницы</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументГраницы</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервыйДокументЗаГП</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПроведения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/DataProcessors/ПроведениеДокументовПути/ObjectModule.bsl
Функция ПолучитьПервыйДокументЗаГП(Граница)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Регистратор
	|ИЗ
	|	Последовательность.ТоварыВПути
	|ГДЕ
	|	МоментВремени>=&Граница
	|   И Регистратор.Проведен	
	|УПОРЯДОЧИТЬ ПО МоментВремени";	
	
	Запрос.УстановитьПараметр("Граница",Граница);	
		
    Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Регистратор;	
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции //ЕстьДокументыПослеГП(Склад,Граница)
 
Функция ПолучитьГП() Экспорт
    ГП.Очистить();
	
	Граница=Последовательности.ТоварыВПути.ПолучитьГраницу();
	
	СтрокаГП=ГП.Добавить();
		
	СтрокаГП.ДатаГраницы		= Граница.Дата;
	СтрокаГП.ДокументГраницы	= Граница.Ссылка;
	
	Если НЕ ЗначениеЗаполнено(СтрокаГП.ДокументГраницы) Тогда
		Граница=Новый МоментВремени(Граница.Дата,Документы.РасходнаяНакладная.ПустаяСсылка());	
	КонецЕсли; 
	
	СтрокаГП.ПервыйДокументЗаГП	= ПолучитьПервыйДокументЗаГП(Граница);	
		
	Если СтрокаГП.ПервыйДокументЗаГП<>Неопределено И НЕ СтрокаГП.ПервыйДокументЗаГП.Пустая() Тогда
		СтрокаГП.ДатаНачалаПроведения = СтрокаГП.ПервыйДокументЗаГП.Дата;		
	КонецЕсли;		
	
	
	Дата1=ТекущаяДата();
	Дата2=ТекущаяДата();
	
	ГП.Сортировать("ДатаНачалаПроведения,ДатаГраницы");
	Для Каждого СтрокаГП Из ГП Цикл
		Если СтрокаГП.ПервыйДокументЗаГП<>Неопределено Тогда
			Дата1			=СтрокаГП.ДатаНачалаПроведения;
			ДокументГраницы	=СтрокаГП.ДокументГраницы;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
КонецФункции

Процедура ПровестиДокументы(Форма=Неопределено) Экспорт

	Если фПакетныйРежим Тогда
		ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Истина;	
		ПараметрыСеанса.ОтключитьКонтрольДЗР		=Истина;
		ПараметрыСеанса.ОтключитьКонтрольРезервов	=Истина;	
	КонецЕсли;	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Регистратор КАК Ссылка,	
	|	Период,
	|	МоментВремени КАК МоментВремени
	|ИЗ
	|	Последовательность.ТоварыВпути
	|ГДЕ 
	|	Период >= &Дата1 И Период<=&Дата2
	|	И Регистратор.Проведен	
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";
	
	Запрос.УстановитьПараметр("Дата1",Дата1);
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
		
	Выборка=Запрос.Выполнить().Выбрать();
	
	Если Форма<>Неопределено Тогда
		Форма.ЭлементыФормы.Индикатор.МаксимальноеЗначение=Выборка.Количество();			
	КонецЕсли;
	
	Индикатор=0;
	
	Дата0	= Дата1;	
	Время0  = ТекущаяДата();
	
	Сч=0;
	
	ЗаписатьВЛог("Пакетное проведение пути","Начало обработки. Проведение с : "+Дата1+". Документ: "+ДокументГраницы,"Информация",Истина);
	
	ДокСсылка="";
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		Сообщить("Проведение: "+Выборка.Ссылка);
		ДокСсылка=Выборка.Ссылка;
		ДокОбъект=Выборка.Ссылка.ПолучитьОбъект();
		
		Если ДокОбъект.Метаданные().Имя="ПриходнаяНакладная" ИЛИ ДокОбъект.Метаданные().Имя="ЗаказПоставщику" Тогда			
			ДокОбъект.ПровестиПоТоварамВПути(Истина);
			Последовательности.ТоварыВПути.УстановитьГраницу(ДокОбъект.МоментВремени());
		Иначе
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;		
		
		Индикатор=Индикатор+1;
		
		Сч=Сч+1;
		
		Если НачалоДня(Дата0)<>НачалоДня(Выборка.Период) Тогда		
			ЗаписатьВЛог("Тайминг проведения пути","Период с : "+Дата0+" по "+Выборка.Период+". Кол-во документов: "+Сч+". Время обработки: "+Формат((ТекущаяДата()-Время0)/60,"ЧДЦ=1; ЧРГ=' '; ЧГ=3,0")+" мин.","Информация");
			
			Дата0	= Выборка.Период;
			Время0  = ТекущаяДата();
			Сч=0;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Сч<>0 Тогда
		ЗаписатьВЛог("Тайминг проведения","Период с : "+Дата0+" по "+Дата2+". Кол-во документов: "+Сч+". Время обработки: "+Формат((ТекущаяДата()-Время0)/60,"ЧДЦ=1; ЧРГ=' '; ЧГ=3,0")+" мин.","Информация");
	КонецЕсли; 
	
	ЗаписатьВЛог("Пакетное проведение","Завершение обработки. Проведено по: "+ДокСсылка,"Информация",Истина);
	
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Ложь;	
	ПараметрыСеанса.ОтключитьКонтрольДЗР		=Ложь;
	ПараметрыСеанса.ОтключитьКонтрольРезервов	=Ложь;	
КонецПроцедуры
